JKI757/CatLocator/esp32-beacon/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_TARGET="esp32s3"
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_DEVICE_NAME="CatLocatorBeacon"
# Wi-Fi credentials are provisioned at runtime
CONFIG_ESP_EVENT_LOOP_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
